<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use App\Models\Major;

class MajorSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $majors = [
            // رشته های نظری
            'نظری - ریاضی و فیزیک',
            'نظری - علوم تجربی',
            'نظری - علوم انسانی',
            'نظری - زبان های خارجی',

            // رشته های فنی و حرفه ای
            'فنی و حرفه ای - برق',
            'فنی و حرفه ای - الکترونیک',
            'فنی و حرفه ای - مکانیک',
            'فنی و حرفه ای - عمران',
            'فنی و حرفه ای - معماری',
            'فنی و حرفه ای - کامپیوتر',
            'فنی و حرفه ای - صنایع غذایی',
            'فنی و حرفه ای - کشاورزی',
            'فنی و حرفه ای - دامپروری',
            'فنی و حرفه ای - جوشکاری',
            'فنی و حرفه ای - خدمات',
            'فنی و حرفه ای - اتومکانیک',
            'فنی و حرفه ای - نقشه کشی صنعتی',
            'فنی و حرفه ای - صنایع دستی',
            'فنی و حرفه ای - چاپ',
            'فنی و حرفه ای - پلاستیک',
            'فنی و حرفه ای - نساجی',
            'فنی و حرفه ای - شیمی',
            'فنی و حرفه ای - مواد غذایی',
            'فنی و حرفه ای - گردشگری',
            'فنی و حرفه ای - هتلداری',
            'فنی و حرفه ای - آرایشگری',
            'فنی و حرفه ای - خیاطی',

            // رشته های کار و دانش
            'کار و دانش - برق',
            'کار و دانش - الکترونیک',
            'کار و دانش - مکانیک',
            'کار و دانش - اتومکانیک',
            'کار و دانش - جوشکاری',
            'کار و دانش - نجاری',
            'کار و دانش - آهنگری',
            'کار و دانش - کامپیوتر',
            'کار و دانش - صنایع غذایی',
            'کار و دانش - کشاورزی',
            'کار و دانش - دامپروری',
            'کار و دانش - خدمات',
            'کار و دانش - صنایع دستی',
            'کار و دانش - آرایشگری',
            'کار و دانش - خیاطی',
            'کار و دانش - تعمیرات موبایل',
            'کار و دانش - تعمیرات لوازم خانگی',
            'کار و دانش - نصب و تعمیر کولر',
            'کار و دانش - کارگاهی',
            'کار و دانش - ساختمان',
            'کار و دانش - سرامیک و کاشی',
            'کار و دانش - رنگ و نقاشی ساختمان',
            'کار و دانش - تاسیسات',
            'کار و دانش - لوله کشی',
            'کار و دانش - بنایی',
            'کار و دانش - قالب بندی'
        ];

        foreach ($majors as $major) {
            Major::create([
                'name' => $major
            ]);
        }
    }
}
